In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns
from sklearn import preprocessing
datadf = pd.read_csv('https://github.com/muthukumaranrprepo/DataAnalyst-Python/blob/main/DataFiles/Churn_Modelling.csv?raw=True')
datadf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           9930 non-null   object
 6   Age              9950 non-null   float64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(3), int64(8), object(3)
memory usage: 1.1+ MB

In [2]:
datadf.Gender.value_counts()

Male      5419
Female    4511
Name: Gender, dtype: int64

In [ ]:
#handle the missing values. Find the most used value with mode()
datadf.Gender.mode()

0    Male
Name: Gender, dtype: object

In [ ]:
#update the missing values using fillna with value returned by mode()
datadf['Gender'] = datadf.Gender.fillna('Male')
datadf.Gender.value_counts()

Male      5489
Female    4511
Name: Gender, dtype: int64

In [ ]:
#Label Encoding Technique
import statistics
from sklearn.preprocessing import LabelEncoder #scikit-learn library ML & statistics model 

le = LabelEncoder()
datadf['Gender_label'] = le.fit_transform(datadf['Gender'].values)
datadf['Gender_label'].value_counts()

1    5489
0    4511
Name: Gender_label, dtype: int64

In [ ]:
# newly created column available at end of df 0 - for female and 1 - male 
datadf.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Gender_label
0,1,15634602,Hargrave,619,France,Female,42.0,2,0.00,1,1,1,101348.88,1,0
1,2,15647311,Hill,608,Spain,Female,41.0,1,83807.86,1,0,1,112542.58,0,0
2,3,15619304,Onio,502,France,Female,42.0,8,159660.80,3,1,0,113931.57,1,0
3,4,15701354,Boni,699,France,Female,39.0,1,0.00,2,0,0,93826.63,0,0
4,5,15737888,Mitchell,850,Spain,Male,43.0,2,125510.82,1,1,1,79084.10,0,1

In [9]:
#One Hot Encoding Technique - sklearn.OneHotEncoder or pd.get_dummies()

datadf_en = pd.get_dummies(datadf['Geography'])
datadf_en.head()

   France  Germany  Spain
0       1        0      0
1       0        0      1
2       1        0      0
3       1        0      0
4       0        0      1

In [ ]:
#drop surnames and all onehot encoding columns available at end of DF
datadf_new = pd.get_dummies(datadf)
datadf_new.head()

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,...,Surname_Zubarev,Surname_Zubareva,Surname_Zuev,Surname_Zuyev,Surname_Zuyeva,Geography_France,Geography_Germany,Geography_Spain,Gender_Female,Gender_Male
0,1,15634602,619,42.0,2,0.00,1,1,1,101348.88,...,0,0,0,0,0,1,0,0,1,0
1,2,15647311,608,41.0,1,83807.86,1,0,1,112542.58,...,0,0,0,0,0,0,0,1,1,0
2,3,15619304,502,42.0,8,159660.80,3,1,0,113931.57,...,0,0,0,0,0,1,0,0,1,0
3,4,15701354,699,39.0,1,0.00,2,0,0,93826.63,...,0,0,0,0,0,1,0,0,1,0
4,5,15737888,850,43.0,2,125510.82,1,1,1,79084.10,...,0,0,0,0,0,0,0,1,0,1

In [ ]:
#drop_first = True will remove the first dummy col
datadf_new = pd.get_dummies(datadf,drop_first=True)
datadf_new.head()

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,...,Surname_Zotova,Surname_Zox,Surname_Zubarev,Surname_Zubareva,Surname_Zuev,Surname_Zuyev,Surname_Zuyeva,Geography_Germany,Geography_Spain,Gender_Male
0,1,15634602,619,42.0,2,0.00,1,1,1,101348.88,...,0,0,0,0,0,0,0,0,0,0
1,2,15647311,608,41.0,1,83807.86,1,0,1,112542.58,...,0,0,0,0,0,0,0,0,1,0
2,3,15619304,502,42.0,8,159660.80,3,1,0,113931.57,...,0,0,0,0,0,0,0,0,0,0
3,4,15701354,699,39.0,1,0.00,2,0,0,93826.63,...,0,0,0,0,0,0,0,0,0,0
4,5,15737888,850,43.0,2,125510.82,1,1,1,79084.10,...,0,0,0,0,0,0,0,0,1,1